modm-ext/data.modm.io/docs/svd/header_stm32f302xc.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <alternatePeripheral>COMP12_COMMON</alternatePeripheral>
      <baseAddress>0x40010020</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2MODE</name>
              <description>COMP2 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2INSEL</name>
              <description>COMP2 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP2NONINSEL</name>
              <description>COMP2 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2WNDWEN</name>
              <description>COMP2 window mode enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2OUTSEL</name>
              <description>COMP2 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP2POL</name>
              <description>COMP2 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2HYST</name>
              <description>COMP2 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2BLANKING</name>
              <description>COMP2 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2OUT</name>
              <description>COMP2 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2LOCK</name>
              <description>COMP2 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP4</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010028</baseAddress>
      <interrupt>
        <name>COMP4_6</name>
        <description>COMP4 and COMP6 global Interrupt via EXTI Line30 and 32</description>
        <value>65</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP4EN</name>
              <description>COMP4 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4MODE</name>
              <description>COMP4 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP4INSEL</name>
              <description>COMP4 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP4NONINSEL</name>
              <description>COMP4 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4OUTSEL</name>
              <description>COMP4 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP4POL</name>
              <description>COMP4 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4HYST</name>
              <description>COMP4 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP4BLANKING</name>
              <description>COMP4 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP4OUT</name>
              <description>COMP4 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP4LOCK</name>
              <description>COMP4 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP6</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010030</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP6EN</name>
              <description>COMP6 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6MODE</name>
              <description>COMP6 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6INSEL</name>
              <description>COMP6 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP6NONINSEL</name>
              <description>COMP6 non inverting input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6OUTSEL</name>
              <description>COMP6 output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>COMP6POL</name>
              <description>COMP6 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6HYST</name>
              <description>COMP6 hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6BLANKING</name>
              <description>COMP6 blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP6OUT</name>
              <description>COMP6 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP6LOCK</name>
              <description>COMP6 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
